tools/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article#
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Tools | Nicky's site</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../rss.xml">
<link rel="canonical" href="https://ndvanforeest.github.io/tools/">
<!--[if lt IE 9]><![endif]--><link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css">
<link rel="stylesheet" href="https://cdn.rawgit.com/jpswalsh/academicons/master/css/academicons.min.css">
<meta name="author" content="Nicky van Foreest">
<meta property="og:site_name" content="Nicky's site">
<meta property="og:title" content="Tools">
<meta property="og:url" content="https://ndvanforeest.github.io/tools/">
<meta property="og:description" content="My Favorite Software Tools


Emacs editor.  My init.el file is on github.
Manjaro linux
i3 window manager
python, numpy, scipy
\(\LaTeX\)
orgmode for keeping notes,
Org babel for literate programming.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-09-30T21:42:32+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-expand-md static-top mb-4
navbar-dark
bg-dark
"><div class="container">
<!-- This keeps the margins nice -->
        <a class="navbar-brand" href="../">

            <span id="blog-title">Nicky's site</span>
        </a>
        <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
        </button>

        <div class="collapse navbar-collapse" id="bs-navbar">
            <ul class="navbar-nav mr-auto">
<li class="nav-item">
<a href="../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../bio/" class="nav-link">Bio</a>
                </li>
<li class="nav-item">
<a href="../books/" class="nav-link">Books</a>
                </li>
<li class="nav-item">
<a href="../presentations/" class="nav-link">Presentations</a>
                </li>
<li class="nav-item">
<a href="../sites/" class="nav-link">Sites</a>
                </li>
<li class="nav-item">
<a href="../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item active">
<a href="." class="nav-link">Tools <span class="sr-only">(active)</span></a>

                
            </li>
</ul>
<ul class="navbar-nav navbar-right">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Tools</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org3224194" class="outline-2">
<h2 id="org3224194">My Favorite Software Tools</h2>
<div class="outline-text-2" id="text-org3224194">
<ul class="org-ul">
<li>
<a href="https://www.gnu.org/software/emacs/">Emacs editor</a>.  My <code>init.el</code> file is on <a href="https://github.com/ndvanforeest/emacs">github</a>.</li>
<li><a href="https://manjaro.org/">Manjaro linux</a></li>
<li><a href="https://i3wm.org/">i3 window manager</a></li>
<li>
<a href="https://www.python.org/">python</a>, <a href="https://numpy.org">numpy</a>, <a href="https://scipy.org">scipy</a>
</li>
<li><a href="https://www.latex-project.org/">\(\LaTeX\)</a></li>
<li>
<a href="https://orgmode.org/">orgmode</a> for keeping notes,</li>
<li>
<a href="https://orgmode.org/worg/org-contrib/babel/">Org babel</a> for literate programming.</li>
<li><a href="https://github.com/ndvanforeest">github</a></li>
<li>
<a href="https://github.com/gpoore/pythontex">pythontex</a> to include python code in \(\LaTeX\), although I am using org babel more and more for this.</li>
<li>
<a href="https://github.com/asottile/blacken-docs">blacken-docs</a> formats python code in python scripts, but also in, for instance, \(\LaTeX\) files.</li>
<li>
<a href="https://github.com/cereda/arara">arara</a> to control the compilation process of \(\LaTeX\) files</li>
</ul>
<ul class="org-ul">
<li>I tended to use <a href="https://pypi.org/project/ipynb-py-convert/">ipynb-py-convert</a> to convert between <code>.py</code> and <code>.ipynb</code> (jupiter notebook) files.
This is practical when you don't like to use the notebook editor.
In my case, I write a python file in emacs.
Then, with adding the minor formatting string <code># %%</code> to delineate the cells, this tool converts the python file to a jupyter notebook file.
However,  orgmode is so much better that I will not use notebooks any time soon.</li>
</ul>
</div>


<div id="outline-container-orgf04f51b" class="outline-3">
<h3 id="orgf04f51b">Youtube videos</h3>
<div class="outline-text-3" id="text-orgf04f51b">
<ul class="org-ul">
<li>
<code>uxplay</code> to mirror my ipad so that I can write on my ipad, with an apple pencil, and have the notes shown on my computer screen (which I can then share with google meet for instance)</li>
<li>
<code>qvidcap</code> for screen capturing. I used <code>cheese</code> before but <code>qvidcap</code> is pre-installed on manjaro.</li>
<li>
<code>kazam</code> to make youtube movies. Before <code>kazam</code> I tried <code>simplescreenrecorder</code>, but this froze my screen a few times.</li>
<li>
<code>qvlc</code> (or <code>vlc</code>) to play video. <code>parole</code> is pre-installed on manjaro linux, but it crashes on my machine.</li>

<li>Perhaps this is a useful tool for screenrecording: <a href="https://obsproject.com/">https://obsproject.com/</a>
</li>

<li>
<code>pinta</code> for on screen drawing. However, now I write on my ipad with an apple pen and share the screen of the ipad via <code>uxplay</code>. The apple pen works amazingly  well on the ipad; I am very satisfied with this actually. (Earlier I use  a wacom device and <code>xournal</code> to write  and draw, but I found is very unpractical to only see on the computer screen what I was writing.)</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org19a86b8" class="outline-2">
<h2 id="org19a86b8">Building this site</h2>
<div class="outline-text-2" id="text-org19a86b8">
<p>
I built this site with <a href="https://getnikola.com/">Nikola</a>, a site generator that I chose for three reasons:
</p>

<ol class="org-ol">
<li>I want to write pages and posts in org format and plain and simple \(\LaTeX\). (I find writing maths in restructured text abhorrant.)</li>
<li>I don't want to use yet another programming language, python suffices for nearly all my goals, and Nikola is written in python.</li>
<li>I want to deploy my site on <a href="https://pages.github.com/">github pages</a>. With nikola it's super easy to achieve that.</li>
</ol>
</div>
</div>
    </div>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha384-3lJUsx1TJHt7BA4udB5KPnDrlkO8T6J6v/op7ui0BbCjvZ9WqV4Xm6DTP6kQ/iBH" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
MathJax.Hub.Config({
  TeX: {
    Macros: {
      P: ["P\\left[#1\\right]", 1],
      E: ["{E\\left[#1\\right]", 1],
    }
  }
});
</script></article><!--End of body content--><footer id="footer"><div class="text-center">
<p>
<span class="fa-stack">
  <a href="https://github.com/ndvanforeest">
    <i class="fa fa-github-square fa-stack-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="http://scholar.google.com/citations?user=IEjX_w4AAAAJ">
     <i class="ai ai-google-scholar-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="https://orcid.org/0000-0001-5428-1723">
     <i class="ai ai-orcid-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="mailto:vanforeest@gmail.com">
    <i class="fa fa-square fa-stack-2x"></i>
    <i class="fa fa-envelope fa-inverse fa-stack-1x"></i>
  </a>
</span>
</p>
<p>
  Contents © 2022  Nicky van Foreest
  —
  
  —
  Powered by <a href="https://getnikola.com" rel="nofollow">Nikola</a>
</p>
</div>

            
            
        </footer>
</div>
</div>


        <script src="../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
